{
    "id": "01df701f-16c0-4b69-9553-bd4f80c5e19d",
    "slug": "absorption",
    "name": "Absorption",
    "editions": [
        {
            "game_edition": "3.5",
            "casting_time_unit": "standard action",
            "description": "As you complete the spell's intricate gestures, you detect a slight buzz at the edge of your hearing. Your body feels warmer, and a feeling of security fills you.\n\nSpells and spell-like effects that target you are absorbed, their energy stored to power spells of your own. Absorption absorbs only ranged spells that have you as a target. Touch spells, effect spells, and area spells that affect you cannot be absorbed.\n\nOnce the spell is cast, you can absorb 1d4+6 spell levels (rolled secretly by the DM). The level of each spell you absorb is subtracted from the total. If a spell is only partially absorbed (because its level exceeds the number of levels remaining to be absorbed), divide the number of spell levels left unabsorbed by the original spell level. For spells that deal damage, use the result to determine what fraction of the damage you take. For spells that create effects, use the result as a percentage chance to be affected.\n\nfor example, you have three spell levels of absorption remaining and are struck by dominate person cast as a 5th level spell. Absorption absorbs three levels of the spell, resulting in a 40% chance (2/5) that you will be affected normally. If affected, any saving throw the spell allows you still applies. Likewise, if you're struck by disintegrate cast as a 6th-level spell with four levels of absorption remaining, two level of the spell remain, and you take only 33% (1/3) of the damage you would normally take from the spell.\n\nYou can use captured spell energy to cast any spell you know or have prepared, but spells so cast don't disappear from your list of prepared spells or count against the number of spells you can normally cast per day (so you must keep a running total of spell levels absorbed and used). The levels of spell energy you have stored must be equal to or greater than the level of the spell you want to cast, and you must have at hand (and expend) any material components required for the spell.",
            "duration": {
                "unit": "minute",
                "per_level": 10,
                "per_level_mode": "per level"
            },
            "is_default": true,
            "levels": [
                { "class": "sorcerer", "level": 9 },
                { "class": "wizard", "level":  9 }
            ],
            "range": { "is_self": true },
            "references": [
                {
                    "source": "spell-compendium",
                    "page_from": 6
                }
            ],
            "school": "abjuration",
            "spell_components": "V,S",
            "target": { "type": "self" }
        }
    ],
    "image": "absorption.webp"
}
