{
    "id": "44c48860-ca95-4023-9cea-8938ff6e0294",
    "slug": "bedevil",
    "name": "Bedevil",
    "editions": [
        {
            "game_edition": "3.5",
            "castingTime_unit": "round",
            "description": "You summon a mischievous spirit and send it to bedevil your enemy. The spirit seeks out its assigned victim wherever they might be, as long as they are on the same plane as you when you cast the spell.\n\nIt then proceeds to irritate and annoy them through a variety of manifestations. The victim of a bedevil spell finds themselves constantly seeing movement out of the corner of their eye. Their sleep is frequently interrupted by bed shaking and blanket shifting and the sounds of voices that fade upon waking. When spellcasting, they suffer a variety of minor irritations that threaten to disrupt the spells, and they constantly feel haunted and watched.\n\nThe result of this bedevilment is that the victim takes a -1 penalty on all ability checks, skill checks, and Will saving throws and has a 5% chance of arcane spell failure (which stacks with any spell failure chance from armor worn).\n\nDetect evil cast upon the subject of this spell reveals the presence of the bedeviling spirit, while protection from evil keeps the spirit from adversely affecting the victim. A dispel evil spell destroys the mischievous spirit, but remove curse or similar magic has no effect on it.",
            "domains": ["evil"],
            "duration": {
                "perLevel": 1,
                "perLevelMode": "per level",
                "unit": "day"
            },
            "hasSpellResistance": true,
            "levels": [
                { "class": "blackguard", "level": 3 },
                { "class": "sorcerer", "level": 3 },
                { "class": "wizard", "level": 3 }
            ],
            "materialComponents": [
                {
                    "item": "drop-of-blood",
                    "quantity": 1,
                    "isConsumed": true
                },
                {
                    "item": "iron-statuette-of-imp",
                    "quantity": 1,
                    "isConsumed": false
                }
            ],
            "materialComponentMode": "and",
            "range": {
                "isSelf": true
            },
            "rarity": "uncommon",
            "references": [
                {
                    "source": "champions-of-ruin",
                    "page_from": 29
                }
            ],
            "school": "summoning",
            "spellComponents": "V,S,M"
        }
    ],
    "image": "bedevil.webp"
}
