[
    {
        "id": "abjuration",
        "name": "Abjuration",
        "description": "Encompasses protective spells, though some have aggressive uses. Can create magical barriers, negate magical or physical abilities, harm trespassers, or even banish to another plane."
    },
    {
        "id": "calling",
        "name": "Calling",
        "parent": "conjuration",
        "description": "Takes creatures from their natural planes and brings them to the caster."
    },
    {
        "id": "charm",
        "name": "Charm",
        "parent": "enchantment",
        "description": "The target of the spell believes someone has a good relationship with them, such as believing an enemy is a friend."
    },
    {
        "id": "compulsion",
        "name": "Compulsion",
        "parent": "enchantment",
        "description": "Force the target to do something beyond their natural will."
    },
    {
        "id": "conjuration",
        "name": "Conjuration",
        "description": "Calls materials, creatures, or energy to the caster or could be reversed to cause the opposite effect, possibly over long distances, or from another plane of existence."
    },
    {
        "id": "creation",
        "name": "Creation",
        "parent": "conjuration",
        "description": "Manipulates matter itself to create an object or creature, often requiring further magic to hold the creation together afterwards."
    },
    {
        "id": "divination",
        "name": "Divination",
        "description": "Allows the caster to see things that are not normally visible, or a great distance away."
    },
    {
        "id": "enchantment",
        "name": "Enchantment",
        "description": "The power to manipulate the minds of others."
    },
    {
        "id": "evocation",
        "name": "Evocation",
        "description": "Manipulate energy or tap an unseen source of power to produce something from nothing. Often used to cause large amounts of damage."
    },
    {
        "id": "figment",
        "name": "Figment",
        "parent": "illusion",
        "description": "Creates an image or sound of something htat isn't there."
    },
    {
        "id": "glamer",
        "name": "Glamer",
        "parent": "illusion",
        "description": "A spell with the ability to fool any of the senses, or make creatures or objects appear or disappear."
    },
    {
        "id": "healing",
        "name": "Healing",
        "parent": "conjuration",
        "description": "Channels positive energy to heal the wounds of creatures or damage of the undead. Powerful healing magic can call dead creatures back from the Fugue Plane."
    },
    {
        "id": "illusion",
        "name": "Illusion",
        "description": "The ability to deceive the minds of others, making them believe they are seeing or hearing things that are not there, or remembering things that never happened."
    },
    {
        "id": "necromancy",
        "name": "Necromancy",
        "description": "The Dark Art, manipulating the energy of the dead, to extend life, drain life from others, or create undead."
    },
    {
        "id": "pattern",
        "name": "Pattern",
        "parent": "illusion",
        "description": "Alter the mind of a perceiver, often with negative effects."
    },
    {
        "id": "phantasm",
        "name": "Phantasm",
        "parent": "illusion",
        "description": "Cast a personal mental image into the mind of another, making them believe they are witnessing something that is not true."
    },
    {
        "id": "scrying",
        "name": "Scrying",
        "parent": "divination",
        "description": "Create an invisible sensor to perceive the world and transmit that information back to the caster."
    },
    {
        "id": "shadow",
        "name": "Shadow",
        "parent": "illusion",
        "description": "A part-illusion, part-reality spell that can affect the world around it for real."
    },
    {
        "id": "summoning",
        "name": "Summoning",
        "parent": "conjuration",
        "description": "Brings an object or creature from one location to the caster. Usually results in the object or creature being returned to its original location once the spell ends."
    },
    {
        "id": "teleportation",
        "name": "Teleportation",
        "parent": "conjuration",
        "description": "Transports the subject(s) over (usually a great) distance, normally via the Astral Plane. Although usually both the origin and destination are on the Material Plane, powerful spells can teleport between planes."
    },
    {
        "id": "transmutation",
        "name": "Transmutation",
        "description": "Change the physical properties of creatures or objects. Formerly known as alteration."
    }
]
