[
    {
        "id": "4a33e843-1593-46e9-a101-82bfbcfc259a",
        "slug": "absorb-weapon",
        "name": "Absorb Weapon",
        "editions": [
            {
                "classes": [
                    { "class": "assassin", "level": 2 }
                ],
                "components": "VS",
                "description": "The weapon you hold in your hand begins to fade from existence as you complete the spell. With the last words of the spell it disappears completely. At the same moment, a weapon-shaped red blotch appears on your arm.</p><p>You can harmlessly absorb a weapon you are touching (even a poisoned one) into your arm, as long as it is not in another creature's possession. The weapon must be a light weapon for you at the time you cast the spell. The absorbed weapon cannot be felt under the skin and doesn't restrict your range of motion in any way. An absorbed weapon cannot be detected with even a careful search, although detect magic reveals the presence of a magical aura. The only evidence of its presence is a faint blotch on your skin shaped vaguely like the weapon.\n\nWhen you touch the spot (an action equivalent to drawing a weapon), or when the spell duration expires, the weapon appears in your hand and the spell ends. If you attack with the weapon in the same round that you retrieve it from its hiding place, you can attempt a Bluff check to feint in combat as a free action, and you gain a -4 on the Bluff check. An intelligent magic weapon gets a saving throw against this spell, but other weapons do not.",
                "game_edition": "3.5",
                "is_default": true,
                "range_is_touch": true,
                "references": [
                    {
                        "source": "spell-compendium",
                        "page_from": 6
                    }
                ],
                "school": "transmutation"
            }
        ]
    },
    {
        "id": "01df701f-16c0-4b69-9553-bd4f80c5e19d",
        "slug": "absorption",
        "name": "Absorption",
        "editions": [
            {
                "classes": [
                    { "class": "sorcerer", "level": 9 },
                    { "class": "wizard", "level":  9 }
                ],
                "components": "VS",
                "description": "As you complete the spell's intricate gestures, you detect a slight buzz at the edge of your hearing. Your body feels warmer, and a feeling of security fills you.\n\nSpells and spell-like effects that target you are absorbed, their energy stored to power spells of your own. Absorption absorbs only ranged spells that have you as a target. Touch spells, effect spells, and area spells that affect you cannot be absorbed.\n\nOnce the spell is cast, you can absorb 1d4+6 spell levels (rolled secretly by the DM). The level of each spell you absorb is subtracted from the total. If a spell is only partially absorbed (because its level exceeds the number of levels remaining to be absorbed), divide the number of spell levels left unabsorbed by the original spell level. For spells that deal damage, use the result to determine what fraction of the damage you take. For spells that create effects, use the result as a percentage chance to be affected.\n\nfor example, you have three spell levels of absorption remaining and are struck by dominate person cast as a 5th level spell. Absorption absorbs three levels of the spell, resulting in a 40% chance (2/5) that you will be affected normally. If affected, any saving throw the spell allows you still applies. Likewise, if you're struck by disintegrate cast as a 6th-level spell with four levels of absorption remaining, two level of the spell remain, and you take only 33% (1/3) of the damage you would normally take from the spell.\n\nYou can use captured spell energy to cast any spell you know or have prepared, but spells so cast don't disappear from your list of prepared spells or count against the number of spells you can normally cast per day (so you must keep a running total of spell levels absorbed and used). The levels of spell energy you have stored must be equal to or greater than the level of the spell you want to cast, and you must have at hand (and expend) any material components required for the spell.",
                "game_edition": "3.5",
                "is_default": true,
                "range_is_self": true,
                "references": [
                    {
                        "source": "spell-compendium",
                        "page_from": 6
                    }
                ],
                "school": "abjuration"
            }
        ]
    },
    {
        "id": "eaadebfa-706b-422d-8f1e-2d7dda62f128",
        "slug": "abyssal-army",
        "name": "Abyssal Army",
        "editions": [
            {
                "classes": [
                    { "class": "cleric", "level":  9 },
                    { "class": "sorcerer", "level": 9 },
                    { "class": "wizard", "level":  9 }
                ],
                "components": "VS",
                "description": "You complete the spell and a hot fog rises from the ground, coiling round you. Stepping out of the billowing steam comes a handful of squat, blubbery demons. Other, greater silhouettes loom behind them, answering your call.\n\nThis spell summons a pack of demons from the Infinite Layers of the Abyss to serve you.\n\nWhen the spell is complete, 2d4 dretches (MM 42) appear. Ten minutes later, 1d4 babau demons (MM 40) appear. Ten minutes after that, one vrock demon (MM 48) appears. Each creature has maximum hit points per Hit Die. Once these creatures appear, they serve you for the duration of the spell.\n\nThe demons obey you explicitly and never attack you, even if someone else manages to gain control over them. You do not need to concentrate to maintain control over the demons. You can dismiss them singly or in groups at any time.",
                "domains": ["chaos", "evil"],
                "game_edition": "3.5",
                "is_default": true,
                "range": 100,
                "range_per_level": 10,
                "range_unit": "ft",
                "references": [
                    {
                        "source": "spell-compendium",
                        "page_from": 7
                    }
                ],
                "school": "conjuration"
            }
        ]
    },
    {
        "id": "d89d5b6f-f4b2-428a-82bf-db9773707574",
        "slug": "air-breathing",
        "name": "Air Breathing",
        "editions": [
            {
                "classes": [
                    { "class":  "cleric", "level":  3 },
                    { "class":  "druid", "level":  3 },
                    { "class":  "sorcerer", "level":  3 },
                    { "class":  "wizard", "level":  3 }
                ],
                "components": "SM",
                "description": "The transmuted creatures can breathe air freely. Divide the duration evenly among all the creatures you touch.\n\nThe spell does not make creatures unable to breathe water. Air breathing dispels and counters water breathing.",
                "game_edition": "3.5",
                "is_default": true,
                "range_is_touch": true,
                "references": [
                    {
                        "source": "champions-of-ruin",
                        "page_from": 28
                    }
                ],
                "school": "transmutation"
            }
        ]
    }
]
